// ignore_for_file: file_names, use_key_in_widget_constructors, prefer_const_constructors

import 'package:flutter/material.dart';

class PrivacyPolicyPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('מדיניות פרטיות'),
        centerTitle: true,
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Align(
              alignment: Alignment.centerRight,
              child: Text(
                'מדיניות פרטיות',
                style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold),
              ),
            ),
            SizedBox(height: 20),
            Align(
              alignment: Alignment.centerRight,
              child: Text(
                '1. איסוף מידע\n\n'
                '2. שימוש במידע\n\n'
                '3. שיתוף נתונים\n\n'
                '4. אבטחת נתונים\n\n'
                '5. בקרות משתמש\n\n'
                '6. עוגיות וטכנולוגיות מעקב\n\n'
                '7. פרטיות הילדים\n\n'
                '8. ציות משפטי\n\n'
                '9. שינויים במדיניות\n\n'
                '10. מידע ליצירת קשר\n\n',
                style: TextStyle(fontSize: 16),
                textDirection: TextDirection.rtl,
              ),
            ),
            Align(
              alignment: Alignment.topCenter,
              child: Text(
                'בדף מדיניות הפרטיות של האפליקציה שלך למכירה וקנייה של חלקי חילוף של מכוניות, חשוב לספק מידע ברור ומקיף על האופן שבו אתה אוסף, משתמש, מאחסן ומגן על הנתונים האישיים של המשתמשים. להלן כמה נקודות מפתח שאולי תרצה לכלול במדיניות הפרטיות שלך:\n\n'
                '1. **איסוף מידע**: הסבר אילו סוגי מידע אישי אתה אוסף ממשתמשים, כגון שם, כתובת דוא"ל, פרטי קשר, נתוני מיקום וכל מידע אחר הנחוץ לשימוש באפליקציה.\n\n'
                '2. **שימוש בנתונים**: תאר כיצד אתה משתמש במידע שנאסף, כולל מטרות כגון מתן שירותים, שיפור הפונקציונליות של האפליקציה, התאמה אישית של חווית משתמש והקלת עסקאות בין קונים למוכרים.\n\n'
                '3. **שיתוף נתונים**: גלה אם אתה משתף נתונים אישיים של משתמשים עם צדדים שלישיים, כגון ספקי שירות, מפרסמים או שותפים עסקיים. הבהירו את המטרות שלשמן ניתן לשתף נתונים ואת הצדדים המעורבים.\n\n'
                '4. **אבטחת נתונים**: תאר את האמצעים שאתה נוקט כדי להבטיח את אבטחת המידע האישי של המשתמשים, כולל הצפנה, נוהלי אחסון נתונים מאובטחים, בקרות גישה וביקורות אבטחה רגילות.\n\n'
                '5. **בקרות משתמש**: הסבירו את האפשרויות הזמינות למשתמשים בנוגע לנתונים האישיים שלהם, כגון גישה, עדכון או מחיקה של המידע שלהם, כמו גם ניהול העדפות תקשורת וביטול הסכמה לאיסוף נתונים.\n\n'
                '6. **עוגיות וטכנולוגיות מעקב**: אם רלוונטי, תאר את השימוש בעוגיות, משואות אינטרנט וטכנולוגיות דומות למעקב אחר אינטראקציות של משתמשים עם האפליקציה, וספק מידע על האופן שבו משתמשים יכולים לנהל את הגדרות העוגיות.\n\n'
                '7. **פרטיות הילדים**: ציינו אם האפליקציה מיועדת לשימוש על ידי ילדים מתחת לגיל 13, ואם כן, פרט שיקולים מיוחדים או הגנות נוספות לטיפול בנתונים אישיים של ילדים בהתאם לתקנות הרלוונטיות (למשל, COPPA ).\n\n'
                '8. **ציות משפטי**: ודא עמידה בחוקים ובתקנות הפרטיות הרלוונטיים, כגון תקנת הגנת המידע הכללית (GDPR), חוק הפרטיות של קליפורניה לצרכן (CCPA), וכל חוקי הגנת מידע רלוונטיים אחרים המבוססים על קהל היעד שלך מקום.\n\n'
                '9. **שינויים במדיניות**: שמור את הזכות לעדכן או לשנות את מדיניות הפרטיות לפי הצורך, ולציין כיצד המשתמשים יקבלו הודעה על שינויים. יעץ למשתמשים לעיין במדיניות מעת לעת לקבלת עדכונים.\n\n'
                '10. **מידע ליצירת קשר**: ספק פרטי התקשרות למשתמשים כדי ליצור קשר עם שאלות, חששות או בקשות הקשורות לזכויות הפרטיות שלהם או למדיניות הפרטיות עצמה.\n\n'
                'חיוני לנספח את מדיניות הפרטיות בשפה ברורה ומובנת, הימנעות ממשפטים, ולהבטיח שקיפות ואחריות בטיפול בנתונים האישיים של המשתמשים. התייעצות עם אנשי מקצוע משפטיים המתמחים בדיני פרטיות עשויה להיות מומלצת גם כדי להבטיח עמידה בתקנות החלות.\n\n',
                style: TextStyle(fontSize: 16),
                textDirection: TextDirection.rtl,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
